# Brewfile - macOS packages via Homebrew
# Install with: brew bundle

# Core tools (required for Eden)
brew "git"
brew "stow"

# Shell & terminal
brew "zsh"
brew "tmux"
brew "fzf"         # Fuzzy finder

# Development utilities
brew "tree"
brew "ripgrep"     # Better grep (rg) - fast code search
brew "fd"          # Better find
brew "bat"         # Better cat with syntax highlighting
brew "fnm"         # Fast Node Manager - multi-version Node.js support
brew "pnpm"        # Fast, efficient package manager

# Editor
brew "neovim"

# System tools
brew "btop"        # Resource monitor
brew "jq"          # JSON processor

# Security & secrets
cask "1password"      # 1Password desktop app (required for CLI authentication)
brew "1password-cli"  # 1Password CLI for secret management
brew "openvpn"        # VPN client for secure connections

# To be added: more tools as Eden grows

