# Brewfile - macOS packages via Homebrew
# Install with: brew bundle

# Core tools (required for Eden)
brew "git"
brew "stow"

# Shell & terminal
brew "zsh"
brew "tmux"
brew "fzf"         # Fuzzy finder
brew "zoxide"      # Smart directory jumper (z/autojump replacement)
brew "starship"    # Cross-shell prompt
cask "ghostty"     # GPU-accelerated native terminal

# Development utilities
brew "tree"
brew "ripgrep"     # Better grep (rg) - fast code search
brew "fd"          # Better find
brew "bat"         # Better cat with syntax highlighting
brew "mise"        # Polyglot runtime/tool manager (node, python, go, etc.)
brew "pnpm"        # Fast, efficient package manager

# Cloud tools
cask "gcloud-cli"  # Google Cloud CLI (gcloud)

# Editors
brew "neovim"
cask "zed"       # GUI editor with AI assistant

# Modern CLI replacements
brew "eza"       # Modern ls replacement (used in .zshrc aliases)

# Keyboard & window management
tap "koekeishiya/formulae"
tap "FelixKratz/formulae"
cask "karabiner-elements"  # Advanced keyboard modifier and remapping
brew "yabai"               # Tiling window manager
brew "skhd"                # Hotkey daemon
brew "borders"             # Active window border highlight

# Browsers
cask "ungoogled-chromium"  # Privacy-focused Chromium without Google integration

# System tools
brew "btop"        # Resource monitor
brew "jq"          # JSON processor

# Security & secrets
cask "1password"      # 1Password desktop app (required for CLI authentication)
cask "1password-cli"  # 1Password CLI for secret management
brew "openvpn"        # VPN client for secure connections

# AI tools
cask "claude-code"    # Anthropic CLI for agentic coding

